DataProcessors/гф_ПочтаРоссииЗапросКТрекеру.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<DataProcessor>
		<Properties>
			<Name>гф_ПочтаРоссииЗапросКТрекеру</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_ПочтаРоссииУчетныеЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовоеОтправление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_ПочтаРоссииПочтовыеОтправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>История</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечнаяОперация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Атрибут</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/гф_ПочтаРоссииЗапросКТрекеру/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЧасовМеждуЗапросами = Константы.гф_ПочтаРоссииПромежутокМеждуЗапросамиКОдномуТрекНомеру.Получить();
	
	Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.гф_ПочтаРоссии_ЗапросКТрекеру);
	
	ЗапрашиватьДанныеПоРасписанию = Задание.Использование;    
	
	Элементы.ГруппаНастройкиЗадания.Видимость = ЗапрашиватьДанныеПоРасписанию;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗапрос(Команда) 
	
	КомандаЗапросНаСервере();
	
	ОповеститьОбИзменении(Объект.ПочтовоеОтправление);
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗапросНаСервере()   
	
	УчетнаяЗапись		= Объект.УчетнаяЗапись;
	ПочтовоеОтправление	= Объект.ПочтовоеОтправление;
	
	Ошибки = Новый Массив;
	
	ОтветМассив = гф_ПочтаРоссии.ПолучитьДанныеОтслеживания(УчетнаяЗапись, ПочтовоеОтправление, Ошибки);
	
	Если Ошибки.Количество() Тогда
		
		Для Каждого Ошибка Из Ошибки Цикл
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка);
			
		КонецЦикла;	 
		
		Возврат;
		
	КонецЕсли;	    
	
	Объект.История.Очистить();
	
	Для Каждого СтрокаОтвета Из ОтветМассив Цикл
		
		НоваяСтрока = Объект.История.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОтвета.Операция);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьРасписаниеНаСервере(); 

	Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.гф_ПочтаРоссии_ЗапросКТрекеру);
	
	РасписаниеРегламентногоЗадания = Задание.Расписание;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьРасписаниеНаСервере(); 

	Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.гф_ПочтаРоссии_ЗапросКТрекеру);
	
	Задание.Расписание = РасписаниеРегламентногоЗадания;
	
	Задание.Записать();

КонецПроцедуры

&НаКлиенте
Процедура КомандаРасписание(Команда) 
	
	ПрочитатьРасписаниеНаСервере();            
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	
	ДополнительныеПараметры = Новый Структура;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриУстановкеРасписания", ЭтотОбъект, ДополнительныеПараметры);
	
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриУстановкеРасписания(Результат, ДополнительныеПараметры) Экспорт 
	
	РасписаниеРегламентногоЗадания = Результат;
	
	ЗаписатьРасписаниеНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы   

&НаСервереБезКонтекста
Процедура ЧасовМеждуЗапросамиПриИзмененииНаСервере(ЧасовМеждуЗапросами)

	Константы.гф_ПочтаРоссииПромежутокМеждуЗапросамиКОдномуТрекНомеру.Установить(ЧасовМеждуЗапросами);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧасовМеждуЗапросамиПриИзменении(Элемент)
	
	ЧасовМеждуЗапросамиПриИзмененииНаСервере(ЧасовМеждуЗапросами);
	
КонецПроцедуры

&НаСервере
Процедура ЗапрашиватьДанныеПоРасписаниюПриИзмененииНаСервере()
	
	Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.гф_ПочтаРоссии_ЗапросКТрекеру);
	
	Задание.Использование = ЗапрашиватьДанныеПоРасписанию;
	
	Задание.Записать();
	
	Элементы.ГруппаНастройкиЗадания.Видимость = ЗапрашиватьДанныеПоРасписанию;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапрашиватьДанныеПоРасписаниюПриИзменении(Элемент)

	ЗапрашиватьДанныеПоРасписаниюПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти
